In [1]:
while True:
    A = int(input("Enter the first number: "))
    B = int(input("Enter the second number: "))
    C = int(input("Choose an operation - 1] ADD 2] MUL 3] SUB 4] DIV: "))
    
    
    if C == 1:
        print("Result:", A + B)
    elif C == 2:
        print("Result:", A * B)
    elif C == 3:
        print("Result:", A - B)
    elif C == 4:
        
        if B != 0:
            print("Result:", A / B)
        else:
            print("Error: Division by zero is not allowed.")
    else:
        print("Invalid operation choice. Please select 1, 2, 3, or 4.")

    d=input("you want to continue yes/no :")
    if d!="yes":
          break
print("thanks for Using ")

Enter the first number:  89
Enter the second number:  90
Choose an operation - 1] ADD 2] MUL 3] SUB 4] DIV:  3

Result: -1

you want to continue yes/no : yes
Enter the first number:  67
Enter the second number:  89
Choose an operation - 1] ADD 2] MUL 3] SUB 4] DIV:  4

Result: 0.7528089887640449

you want to continue yes/no : no

thanks for Using

In [22]:
import math

In [23]:
import math as met

In [24]:
from math import sqrt

In [25]:
from math import*

In [31]:
math.sqrt(33)

5.744562646538029

In [1]:
import seaborn as sns

In [4]:
df=sns.load_dataset("iris")

In [5]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [7]:
data={
    "name":["prasad","siddharth","Harshal"],
    "age" :[23,22,21]
}

In [10]:
import pandas as pd

In [11]:
df1=pd.DataFrame(data)

In [12]:
df1

        name  age
0     prasad   23
1  siddharth   22
2    Harshal   21

In [23]:
df.iloc[[0][0]]

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
Name: 0, dtype: object

In [24]:
import sklearn

In [27]:
from sklearn.datasets import fetch_openml

In [44]:
dataset = fetch_openml("titanic", version=1, as_frame=True, parser='auto')['data']

In [45]:
dataset

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [57]:
df.loc[(df['name'] == 'prasad') ,axis= 0)]

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' (2661577790.py, line 1)